{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(5, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(5,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "hybridsequential0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "5", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "hybridsequential0_conv0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "hybridsequential0_pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(5, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(5,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "hybridsequential0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "5", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "hybridsequential0_conv1_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "hybridsequential0_pool1_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "hybridsequential0_flatten0_flatten0", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_dense0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_dense0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "hybridsequential0_dense0_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "32"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "hybridsequential0_dense0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_dense1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "hybridsequential0_dense1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "hybridsequential0_dense1_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 12, 13, 16, 17], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    7, 
    8, 
    9, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21
  ], 
  "heads": [[18, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10401]}
}